#ifndef RM_REFEREE_H
#define RM_REFEREE_H

#include "usart.h"
#include "referee_protocol.h"
// #include "robot_def.h"
#include "RM_typedef.h"
#include "bsp_usart.h"
// #include "FreeRTOS.h"

extern uint8_t UI_Seq;

#pragma pack(1)
typedef struct
{
	uint8_t Robot_Color;		// 机器人颜色
	uint16_t Robot_ID;			// 本机器人ID
	uint16_t Cilent_ID;			// 本机器人对应的客户端ID
	uint16_t Receiver_Robot_ID; // 机器人车间通信时接收者的ID，必须和本机器人同颜色
} referee_id_t;

// 此结构体包含裁判系统接收数据以及UI绘制与机器人车间通信的相关信息
typedef struct
{
	referee_id_t referee_id;

	xFrameHeader FrameHeader; // 接收到的帧头信息
	uint16_t CmdID;
	ext_game_state_t GameState;							   // 0x0001
	ext_game_result_t GameResult;						   // 0x0002
	ext_game_robot_HP_t GameRobotHP;					   // 0x0003
	ext_event_data_t EventData;							   // 0x0101
	ext_game_robot_state_t GameRobotState;				   // 0x0201
	ext_power_heat_data_t PowerHeatData;				   // 0x0202
	ext_game_robot_pos_t GameRobotPos;					   // 0x0203
	ext_buff_musk_t BuffMusk;							   // 0x0204
	ext_robot_hurt_t RobotHurt;							   // 0x0206
	ext_shoot_data_t ShootData;							   // 0x0207
	ext_projectile_allowance_t ProjectileAllowance;		   // 0x0208

	uint8_t init_flag;

} referee_info_t;

// 模式是否切换标志位，0为未切换，1为切换，static定义默认为0
typedef struct
{
	uint32_t chassis_flag : 1;
	uint32_t gimbal_flag : 1;
	uint32_t shoot_flag : 1;
	uint32_t lid_flag : 1;
	uint32_t friction_flag : 1;
	uint32_t Power_flag : 1;
} Referee_Interactive_Flag_t;



#pragma pack()
extern referee_info_t referee_info; // 裁判系统数据
/**
 * @brief 裁判系统通信初始化,该函数会初始化裁判系统串口,开启中断
 *
 * @param referee_usart_handle 串口handle,C板一般用串口6
 * @return referee_info_t* 返回裁判系统反馈的数据,包括热量/血量/状态等
 */
void RefereeInit(void);

// 获取裁判系统接收缓存指针
uint8_t *Referee_Get_Buffer(void);

/// @brief 获取裁判系统实例（返回裁判系统的数据结构体）
/// @param
/// @return
referee_info_t *Referee_Get_Instance(void);

/// @brief 裁判系统串口解析函数(应放入串口接收中断)
/// @param Buffer 接收到的数据指针（应配合Referee_Get_Buffer()进行使用，将数据传入RE_RX_Buffer即裁判系统接收缓存）
/// @param size 接收到的字节数
void Referee_RX_Callback(uint8_t *Buffer, uint8_t size); // 应放入接收中断

///**
// * @brief UI绘制和交互数的发送接口,由UI绘制任务和多机通信函数调用
// * @note 内部包含了一个实时系统的延时函数,这是因为裁判系统接收CMD数据至高位10Hz
// *
// * @param send 发送数据首地址
// * @param tx_len 发送长度
// *
// * */

//void RefereeSend(uint8_t *send, uint16_t tx_len);

#endif // !REFEREE_H
